bit-finance/Reports/бит_ЗависимостьСтатейОборотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_ЗависимостьСтатейОборотов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборЗависимости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/InformationRegisters/бит_ЗависимыеОбороты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗависимыеОбороты</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрофильРаспределения</Name>
					<Comment>Профиль распределения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПрофилиРаспределенияПоПериодам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентКоличество</Name>
					<Comment>Коэффициент для расчета количества</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентСумма</Name>
					<Comment>Коэффициент для расчета суммы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитКоличество</Name>
					<Comment>Реквизит для расчета количества</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РеквизитыДляРасчетаЗависимостей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитСумма</Name>
					<Comment>Реквизит для расчета суммы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РеквизитыДляРасчетаЗависимостей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФункцияКоличество</Name>
					<Comment>Функция количество</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеФункции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФункцияСумма</Name>
					<Comment>Функция сумма</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеФункции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИгнорироватьПриоритеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиЗависимыхОборотов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СценарийЗависимый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Comment>ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов по бюджетам</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_1</Name>
					<Comment>Дополнительная аналитика № 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_2</Name>
					<Comment>Дополнительная аналитика № 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_3</Name>
					<Comment>Дополнительная аналитика № 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_4</Name>
					<Comment>Дополнительная аналитика № 4</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_5</Name>
					<Comment>Дополнительная аналитика № 4</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_6</Name>
					<Comment>Дополнительная аналитика № 6</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_7</Name>
					<Comment>Дополнительная аналитика № 7</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_8</Name>
					<Comment>Дополнительная аналитика № 8</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_9</Name>
					<Comment>Дополнительная аналитика № 9</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_10</Name>
					<Comment>Дополнительная аналитика № 10</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_11</Name>
					<Comment>Дополнительная аналитика № 11</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_12</Name>
					<Comment>Дополнительная аналитика № 12</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО_Зависимый</Name>
					<Comment>ЦФО зависимое</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяОборотов_Зависимый</Name>
					<Comment>Статья оборотов по бюджетам зависимая</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация_Зависимый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_1_Зависимый</Name>
					<Comment>Дополнительная аналитика № 1 зависимая</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_2_Зависимый</Name>
					<Comment>Дополнительная аналитика № 2 зависимая</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_3_Зависимый</Name>
					<Comment>Дополнительная аналитика № 3 зависимая</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_4_Зависимый</Name>
					<Comment>Дополнительная аналитика № 4 зависимая</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_5_Зависимый</Name>
					<Comment>Дополнительная аналитика № 5 зависимая</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_6_Зависимый</Name>
					<Comment>Дополнительная аналитика № 6 зависимая</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_7_Зависимый</Name>
					<Comment>Дополнительная аналитика № 7 зависимая</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_8_Зависимый</Name>
					<Comment>Дополнительная аналитика № 8 зависимая</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_9_Зависимый</Name>
					<Comment>Дополнительная аналитика № 9 зависимая</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_10_Зависимый</Name>
					<Comment>Дополнительная аналитика № 10 зависимая</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_11_Зависимый</Name>
					<Comment>Дополнительная аналитика № 11 зависимая</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_12_Зависимый</Name>
					<Comment>Дополнительная аналитика № 12 зависимая</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Reports/бит_ЗависимостьСтатейОборотов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьКомпоновщикОтбораСтатей();
	Отчет.НаДату = ТекущаяДатаСеанса();
	ОбновитьДеревоСтатей();
	
	УстановитьУсловноеОформление();
	УстановитьОтборыЗависимыхОборотов();
	НастроитьОтображениеДополнительныхАналитик();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтметкиРежимаПросмотра();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура СценарийПриИзмененииНаСервере()
	
	ОбновитьДеревоСтатей();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	
	СценарийПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НаДатуПриИзмененииНаСервере()
	
	ОбновитьДеревоСтатей();
	
КонецПроцедуры

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	
	НаДатуПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтборЗависимостиПриИзмененииНаСервере()
	
	ОбновитьДеревоСтатей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗависимостиПриИзменении(Элемент)
	
	ОтборЗависимостиПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтатьиОборотов

&НаКлиенте
Процедура СтатьиОборотовПриАктивизацииСтроки(Элемент)
	
	ОтключитьОбработчикОжидания("СтатьиОборотовОжиданиеАктивизацииОбласти");
	ПодключитьОбработчикОжидания("СтатьиОборотовОжиданиеАктивизацииОбласти",0.1,Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура СтатьиОборотовОжиданиеАктивизацииОбласти()
	
	РежимДерева = (Элементы.СтатьиОборотов.Отображение = ОтображениеТаблицы.Дерево);
	Элементы.СтатьиОборотовРазвернутьВсе.Доступность = РежимДерева;
	Элементы.СтатьиОборотовСвернутьВсе.Доступность   = РежимДерева;
	
	ТекущиеДанные = Элементы.СтатьиОборотов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ТекущаяСтатьяОборотов = Неопределено;
	Иначе
		ТекущаяСтатьяОборотов = ТекущиеДанные.СтатьяОборотов;
	КонецЕсли;
	
	УстановитьОтборыЗависимыхОборотов();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиОборотовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СтатьиОборотов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ТекущиеДанные.СтатьяОборотов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗависимыеОбороты

&НаКлиенте
Процедура ЗависимыеОборотыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанныеЗависимых = Элемент.ТекущиеДанные;
	Если ТекущиеДанныеЗависимых = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор = ТекущиеДанныеЗависимых.Регистратор;
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.бит_УстановкаЗависимыхОборотов") Тогда
		СтандартнаяОбработка = Ложь;
		
		КлючАвтопозиционирования = Новый Структура;
		КлючАвтопозиционирования.Вставить("Ссылка", Регистратор); 
		КлючАвтопозиционирования.Вставить("СтатьяОборотов", ТекущаяСтатьяОборотов);
		КлючАвтопозиционирования.Вставить("СтатьяОборотов_Зависимый", ТекущиеДанныеЗависимых.СтатьяОборотов_Зависимый);
		НомерСтрокиЗависимыхОборотов = НомерСтрокиЗависимыхОборотов(КлючАвтопозиционирования);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", Регистратор);
		ПараметрыФормы.Вставить("НомерТекущейСтроки", НомерСтрокиЗависимыхОборотов);
	
		ОткрытьФорму("Документ.бит_УстановкаЗависимыхОборотов.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикОтборовСтатейОборотовНастройкиОтбор

&НаКлиенте
Процедура КомпоновщикОтборовСтатейОборотовНастройкиОтборПриИзменении(Элемент)
	
	КомпоновщикОтборовСтатейОборотовНастройкиОтборПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДанныеОтчета(Команда)
	
	ОбновитьДеревоСтатей();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	РекурсивнаяРазверткаСвертка(СтатьиОборотов, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	РекурсивнаяРазверткаСвертка(СтатьиОборотов, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВызовОтборовСтатейОборотов(Команда)
	
	Элементы.КомпоновщикОтборовСтатейОборотовНастройкиОтбор.Видимость = НЕ Элементы.КомпоновщикОтборовСтатейОборотовНастройкиОтбор.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПросмотраТолькоЭлементы(Команда)
	
	Если ТолькоЭлементы Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтатьиОборотов.Отображение = ОтображениеТаблицы.Список;
	
	ТолькоЭлементы = Истина;
	ОбновитьДеревоСтатей();
	
	УстановитьОтметкиРежимаПросмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПросмотраСписок(Команда)
	
	Элементы.СтатьиОборотов.Отображение = ОтображениеТаблицы.Список;
	
	Если ТолькоЭлементы Тогда
		ТолькоЭлементы = Ложь;
		ОбновитьДеревоСтатей();
	КонецЕсли;
	
	УстановитьОтметкиРежимаПросмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПросмотраДерево(Команда)
	
	Элементы.СтатьиОборотов.Отображение = ОтображениеТаблицы.Дерево;
	
	Если ТолькоЭлементы Тогда
		ТолькоЭлементы = Ложь;
		ОбновитьДеревоСтатей();
	КонецЕсли;
	
	УстановитьОтметкиРежимаПросмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПросмотраИерархическийСписок(Команда)
	
	Элементы.СтатьиОборотов.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	
	Если ТолькоЭлементы Тогда
		ТолькоЭлементы = Ложь;
		ОбновитьДеревоСтатей();
	КонецЕсли;
	
	УстановитьОтметкиРежимаПросмотра();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСОтборамиСтатейОборотов

&НаСервере
Процедура ИнициализироватьКомпоновщикОтбораСтатей()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	СКДОтбораСтатейОборотов = ОтчетОбъект.ПолучитьМакет("ОтборСтатейОборотов");
	
	КомпоновщикОтборовСтатейОборотов.ЗагрузитьНастройки(СКДОтбораСтатейОборотов.НастройкиПоУмолчанию);
	
	АдресСКДОтбораСтатейОборотов = ПоместитьВоВременноеХранилище(СКДОтбораСтатейОборотов, УникальныйИдентификатор);
	КомпоновщикОтборовСтатейОборотов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСКДОтбораСтатейОборотов));
	
КонецПроцедуры

&НаСервере
Функция ОтборныеСтатьиОборотов()
	
	НастройкиКомпоновщика = КомпоновщикОтборовСтатейОборотов.Настройки;
	ЕстьОтборы = Ложь;
	Для каждого ЭлементОтбора Из НастройкиКомпоновщика.Отбор.Элементы Цикл
		Если ЭлементОтбора.Использование Тогда
			ЕстьОтборы = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьОтборы Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СКДОтбораСтатейОборотов = ПолучитьИзВременногоХранилища(АдресСКДОтбораСтатейОборотов);    
	
	// Формируем макет, с помощью компоновщика макета.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СКДОтбораСтатейОборотов, НастройкиКомпоновщика,,,
							Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Выполним компоновку с помощью процессора компоновки.
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ОтборныеСтатьи = ТаблицаРезультат.ВыгрузитьКолонку("СтатьяОборотов");
	
	Возврат ОтборныеСтатьи;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ОбновитьДеревоСтатей()
	
	ФильтрСтатейПоОтбору = ОтборныеСтатьиОборотов();
	
	ТекущаяСтатьяОборотов = Неопределено;
	
	ДеревоСтатей = РеквизитФормыВЗначение("СтатьиОборотов");
	ДеревоСтатей.Строки.Очистить();
	
	Запрос       = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиОборотов.Ссылка КАК СтатьяОборотов,
	|	СтатьиОборотов.ЭтоГруппа КАК ЭтоГруппа,
	|	СтатьиОборотов.Наименование КАК Наименование,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗависимыеОбороты.СтатьяОборотов_Зависимый ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьЗависимость,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗависимыеОбороты.СтатьяОборотов_Зависимый ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьНеустановленные,
	|	СтатьиОборотов.Кодификатор КАК Кодификатор,
	|	СтатьиОборотов.ТипСтатьи КАК ТипСтатьи
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЗависимыеОбороты КАК ЗависимыеОбороты
	|		ПО (ЗависимыеОбороты.СтатьяОборотов = СтатьиОборотов.Ссылка)
	|			И (ЗависимыеОбороты.СценарийЗависимый = ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка))
	|			И (ЗависимыеОбороты.Сценарий = &Сценарий)
	|			И (&НаДату >= ЗависимыеОбороты.Период)
	|			И (&НаДату <= ЗависимыеОбороты.ДатаОкончания
	|				ИЛИ ЗависимыеОбороты.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|ГДЕ
	|	НЕ СтатьиОборотов.ЭтоГруппа
	|	И НЕ СтатьиОборотов.ПометкаУдаления
	|	И (&ОтборЗависимости = 0
	|			ИЛИ &ОтборЗависимости = 1
	|				И ЗависимыеОбороты.СтатьяОборотов_Зависимый ЕСТЬ НЕ NULL 
	|			ИЛИ &ОтборЗависимости = 2
	|				И ЗависимыеОбороты.СтатьяОборотов_Зависимый ЕСТЬ NULL)
	|	И &ПереопределяемыйФильтрСтатей
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатьиОборотов.Ссылка,
	|	СтатьиОборотов.ЭтоГруппа,
	|	СтатьиОборотов.Наименование,
	|	СтатьиОборотов.Кодификатор,
	|	СтатьиОборотов.ТипСтатьи
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа УБЫВ,
	|	Наименование";
	Если ФильтрСтатейПоОтбору = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПереопределяемыйФильтрСтатей", "ИСТИНА");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
									"&ПереопределяемыйФильтрСтатей",
									"СтатьиОборотов.Ссылка В (&ФильтрСтатейПоОтбору)");
		Запрос.УстановитьПараметр("ФильтрСтатейПоОтбору", ФильтрСтатейПоОтбору);;
	КонецЕсли;
	Если НЕ ТолькоЭлементы Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ИТОГИ
		|	МАКСИМУМ(ЕстьЗависимость),
		|	МАКСИМУМ(ЕстьНеустановленные)
		|ПО
		|	СтатьяОборотов ИЕРАРХИЯ";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Сценарий", Отчет.Сценарий);
	Запрос.УстановитьПараметр("НаДату", Отчет.НаДату);
	Запрос.УстановитьПараметр("ОтборЗависимости", Отчет.ОтборЗависимости);
	Если ТолькоЭлементы Тогда
		ВыборкаСтатей = Запрос.Выполнить().Выбрать();
	Иначе
		ВыборкаСтатей = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "СтатьяОборотов");
	КонецЕсли;
	ЗаполнитьСтатьиРекурсивно(ДеревоСтатей.Строки, ВыборкаСтатей);
	
	ЗначениеВРеквизитФормы(ДеревоСтатей, "СтатьиОборотов");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСтатьиРекурсивно(КоллекцияСтрокДерева, ВыборкаСтатей)
	
	Пока ВыборкаСтатей.Следующий() Цикл
		НоваяСтрокаДерева = КоллекцияСтрокДерева.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева, ВыборкаСтатей);
		
		НоваяСтрокаДерева.ИдентификаторКартинки = ?(ВыборкаСтатей.ЭтоГруппа, 1, 2);
			
		Если ВыборкаСтатей.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда
			ВыборкаВложенногоУровня = ВыборкаСтатей.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "СтатьяОборотов");
			ЗаполнитьСтатьиРекурсивно(НоваяСтрокаДерева.Строки, ВыборкаВложенногоУровня);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыЗависимыхОборотов()
	
	ЭлементыПараметров = ЗависимыеОбороты.Параметры.Элементы;
	
	ПараметрСценарий = ЭлементыПараметров.Найти("Сценарий");
	ПараметрСценарий.Значение      = Отчет.Сценарий;
	ПараметрСценарий.Использование = Истина;
	
	ПараметрСтатьяОборотов = ЭлементыПараметров.Найти("СтатьяОборотов");
	ПараметрСтатьяОборотов.Значение      = ТекущаяСтатьяОборотов;
	ПараметрСтатьяОборотов.Использование = Истина;
	
	ПараметрДатаОкончания = ЭлементыПараметров.Найти("ДатаОкончания");
	ПараметрДатаОкончания.Значение      = Отчет.НаДату;
	ПараметрДатаОкончания.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СтатьиОборотов.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатьиОборотов.ЕстьЗависимость");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатьиОборотов.ЕстьНеустановленные");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ФонПодписьВерна);
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СтатьиОборотов.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатьиОборотов.ЕстьЗависимость");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатьиОборотов.ЕстьНеустановленные");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.бит_ЦветФонаПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура РекурсивнаяРазверткаСвертка(РодительскийЭлемент, Развернуть)
	
	ЭлементыДерева = РодительскийЭлемент.ПолучитьЭлементы();
	Для каждого ЭлементДерева Из ЭлементыДерева Цикл
		РекурсивнаяРазверткаСвертка(ЭлементДерева, Развернуть);
		Если Развернуть Тогда
        	Элементы.СтатьиОборотов.Развернуть(ЭлементДерева.ПолучитьИдентификатор());
		Иначе
			Элементы.СтатьиОборотов.Свернуть(ЭлементДерева.ПолучитьИдентификатор());
		КонецЕсли;
    КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура КомпоновщикОтборовСтатейОборотовНастройкиОтборПриИзмененииНаСервере()
	
	ОбновитьДеревоСтатей();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеДополнительныхАналитик()
	
	ИзмеренияДоп       = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Дополнительные", "Синоним"); 
	НастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();
	
	ШаблонЭлементаАналитики          = "ЗависимыеОбороты%1";
	ШаблонСинонимаЗависимойАналитики = НСтр("ru='%1 зависимый'");
	Для каждого ИзмерениеБюджетирования Из ИзмеренияДоп Цикл
		ИмяИзмерения                  = ИзмерениеБюджетирования.Ключ;
		ИмяЭлементаАналитики          = СтрШаблон(ШаблонЭлементаАналитики, ИмяИзмерения);
		ИмяЭлементаЗависимойАналитики = ИмяЭлементаАналитики + "_Зависимый";
		НастройкаИзмерения            = НастройкиИзмерений.Получить(ИмяИзмерения);
		Если НастройкаИзмерения = Неопределено Тогда
			Элементы[ИмяЭлементаАналитики].Видимость          = Ложь;
			Элементы[ИмяЭлементаЗависимойАналитики].Видимость = Ложь;
		Иначе
			Элементы[ИмяЭлементаАналитики].Видимость          = Истина;
			Элементы[ИмяЭлементаАналитики].Заголовок          = НастройкаИзмерения.Синоним;
			Элементы[ИмяЭлементаЗависимойАналитики].Видимость = Истина;
			Элементы[ИмяЭлементаЗависимойАналитики].Заголовок = СтрШаблон(ШаблонСинонимаЗависимойАналитики,
																	НастройкаИзмерения.Синоним);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НомерСтрокиЗависимыхОборотов(КлючАвтопозиционирования)
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗависимыеОбороты.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.бит_УстановкаЗависимыхОборотов.ЗависимыеОбороты КАК ЗависимыеОбороты
	|ГДЕ
	|	&ПараметрыПоиска";
	ПараметрыПоиска = Новый Массив;
	ШаблонПоиска    = "ЗависимыеОбороты.%1 = &%1";
	Для каждого ЭлементОтбора Из КлючАвтопозиционирования Цикл
		КлючПоиска     = ЭлементОтбора.Ключ;
		ЗначениеПоиска = ЭлементОтбора.Значение;
		ПараметрыПоиска.Добавить(СтрШаблон(ШаблонПоиска, КлючПоиска));
		Запрос.УстановитьПараметр(КлючПоиска, ЗначениеПоиска);
	КонецЦикла;
	ТекстПоиска  = СтрСоединить(ПараметрыПоиска, Символы.ПС + Символы.Таб + "И ");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПараметрыПоиска", ТекстПоиска);
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.НомерСтроки;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтметкиРежимаПросмотра()
	
	ОтображениеСписка = Элементы.СтатьиОборотов.Отображение;
	
	Элементы.СтатьиОборотовРежимПросмотраТолькоЭлементы.Пометка = ТолькоЭлементы;
	Элементы.СтатьиОборотовРежимПросмотраСписок.Пометка = НЕ ТолькоЭлементы
								И (ОтображениеСписка = ОтображениеТаблицы.Список);
	Элементы.СтатьиОборотовРежимПросмотраДерево.Пометка = НЕ ТолькоЭлементы
								И (ОтображениеСписка = ОтображениеТаблицы.Дерево);
	Элементы.СтатьиОборотовРежимПросмотраИерархическийСписок.Пометка = НЕ ТолькоЭлементы
								И (ОтображениеСписка = ОтображениеТаблицы.ИерархическийСписок);
	
КонецПроцедуры

#КонецОбласти
